--
-- Author: Ace
-- Date: 2014-03-29 02:08:45
--
local Language = {}

Language.info = {
	start 	= " 欢迎来到水晶【小二传奇】 ",
	guide 	= " 手指触摸屏幕并向你希望的方向滑动 ",
	clicked = " 需要在屏幕上滑动... ",
	pressed = " 有一个秘密，但是我不想告诉你 ",
	moved 	= {
		" 继续…… ",
		" 水晶越多越刺激！",
		" 合并一些更大的数吧！",
		" 让水晶来得更猛烈一些吧！ ",
		" 最大的数放在角落里更安全 ",
		" 能屈能伸真豪杰，落子无悔大豆腐 ",
		" 鄙视悔棋的家伙，这游戏还能玩？",
		" 游戏虽易，开发不易，且玩且珍惜 ",
		" 按分数板可切换显示当前分数和最佳成绩 ",
	},
	merged = {
		" 干得漂亮！ ",
		" 干得不错！ ",
		" 新的水晶总是出现在移动行最后的位置 ",
		" 水晶让人着迷，破坏令人发指！ ",
		" 【小二传奇】这个名字太土了！ ",
		" 50000分不是地球人可以达到的高度",
		" 2048是个神秘水晶，能看到的都是大神 ",
		" 大坑已挖好，大数字的水晶即将出现 ",
		" 不要把所有水晶都放在一个框子里面 ",
	},

	lost 		= " 你已走投无路, 再来一次？ ",
	nomoved 	= " 你不能向这个方向移动！ " ,
	win1	 	= " 你成功合成了一个新的水晶 ",
	win2	 	= " 你太棒了, 我不能相信自己的眼睛 ",
	win3		= " 所有人都过来，过来看上帝！",
	undoHint	= " 比反悔更无耻的事是死不改悔！ ",
	undoed		= " 好吧，如你所愿…… ",
	notUndo		= " 世上没有那么多后悔药啊 ",
	restartHint = " 按住按钮保持1秒，以确认开始新游戏 ",
	exitHint	= " 再按一次退出游戏 ",
	saved 		= " 当前游戏进度已保存 ", 
	restored 	= " 继续游戏或者点新游戏重新开始 ",
}

Language.title = {
	newgame 	= " 新游戏 ",
	exit 		= " 退出 ",
	text 		= "合并相同数字的水晶\n黑2只能和白2合并 ...",
	-- text1 		= "合并相同数字的水晶达到高分，黑2只能和白2合并...",
	currScore 	= "当前分数",
	bestScore 	= "最高分数",
	bestCell 	= "最高成就",
	nextCell 	= "下一个",
}


return Language
